Joelin-CN/2026Diansai/2026task/stm32/v1.0/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MOTOR_C_IN1_Pin GPIO_PIN_2
#define MOTOR_C_IN1_GPIO_Port GPIOE
#define MOTOR_C_IN2_Pin GPIO_PIN_3
#define MOTOR_C_IN2_GPIO_Port GPIOE
#define KEY1_Pin GPIO_PIN_0
#define KEY1_GPIO_Port GPIOC
#define KEY1_EXTI_IRQn EXTI0_IRQn
#define KEY2_Pin GPIO_PIN_1
#define KEY2_GPIO_Port GPIOC
#define KEY2_EXTI_IRQn EXTI1_IRQn
#define KEY3_Pin GPIO_PIN_2
#define KEY3_GPIO_Port GPIOC
#define KEY3_EXTI_IRQn EXTI2_IRQn
#define KEY4_Pin GPIO_PIN_3
#define KEY4_GPIO_Port GPIOC
#define KEY4_EXTI_IRQn EXTI3_IRQn
#define KEY5_Pin GPIO_PIN_4
#define KEY5_GPIO_Port GPIOC
#define KEY5_EXTI_IRQn EXTI4_IRQn
#define IMU_CS_Pin GPIO_PIN_7
#define IMU_CS_GPIO_Port GPIOE
#define IMU_INT1_Pin GPIO_PIN_8
#define IMU_INT1_GPIO_Port GPIOE
#define IMU_INT1_EXTI_IRQn EXTI9_5_IRQn
#define MOTOR_B_PWM_Pin GPIO_PIN_9
#define MOTOR_B_PWM_GPIO_Port GPIOE
#define SERVO_DIR_Pin GPIO_PIN_10
#define SERVO_DIR_GPIO_Port GPIOE
#define MOTOR_C_PWM_Pin GPIO_PIN_11
#define MOTOR_C_PWM_GPIO_Port GPIOE
#define ENC_RIGHT_A_Pin GPIO_PIN_12
#define ENC_RIGHT_A_GPIO_Port GPIOD
#define ENC_RIGHT_B_Pin GPIO_PIN_13
#define ENC_RIGHT_B_GPIO_Port GPIOD
#define MOTOR_B_IN1_Pin GPIO_PIN_14
#define MOTOR_B_IN1_GPIO_Port GPIOD
#define MOTOR_B_IN2_Pin GPIO_PIN_15
#define MOTOR_B_IN2_GPIO_Port GPIOD
#define ENC_LEFT_A_Pin GPIO_PIN_4
#define ENC_LEFT_A_GPIO_Port GPIOB
#define ENC_LEFT_B_Pin GPIO_PIN_5
#define ENC_LEFT_B_GPIO_Port GPIOB
#define MOTOR_STBY_Pin GPIO_PIN_0
#define MOTOR_STBY_GPIO_Port GPIOE

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
